content/remark/2017/09/sequence-diagram.md
```text
sequenceDiagram
    カバ->>+カバン: あなた、泳げまして？
    カバン-->>-カバ: いえ
    カバ->>+カバン: 空は飛べるんですの？
    カバン-->>-カバ: いえ
    カバ->>+カバン: じゃあ、足が速いとか？
    カバン-->>-カバ: いえ
    カバ->>カバン: あなた、何にもできないのねぇ
    loop ひとりヘコむ
        カバン->>カバン: ううっ
    end
```
